Repository: Kombuchameister/my-whisper-fork
Catalog: TypeWhisperPluginSDK/Plugins/WebLinkPlugin/Localizable.xcstrings
Source language: en
Languages: de, zh_hans

source: This version of TypeWhisper cannot start transcriptions for add-ons.
de: Diese TypeWhisper-Version kann keine Transkriptionen für Add-ons starten.
zh_hans: 此版本的 TypeWhisper 无法为附加组件启动转录。

source: Created the note “%@”. The transcript is added when transcription finishes.
de: Notiz „%@“ erstellt. Das Transkript wird eingefügt, sobald die Transkription fertig ist.
zh_hans: 已创建笔记“%@”。转录完成后将添加转录文本。

source: Add to Obsidian
de: Zu Obsidian hinzufügen
zh_hans: 添加到 Obsidian

source: Create an Obsidian note named after the video and fill in the transcript automatically.
de: Eine nach dem Video benannte Obsidian-Notiz erstellen und das Transkript automatisch einfügen.
zh_hans: 创建以视频命名的 Obsidian 笔记并自动填入转录文本。

source: Obsidian notes
de: Obsidian-Notizen
zh_hans: Obsidian 笔记

source: “Add to Obsidian” creates a note named after the video in this folder, with the link as its first line, and adds the transcript when transcription finishes. It uses the engine selected under File Transcription.
de: „Zu Obsidian hinzufügen“ erstellt in diesem Ordner eine nach dem Video benannte Notiz mit dem Link in der ersten Zeile und fügt das Transkript ein, sobald die Transkription fertig ist. Verwendet wird die unter Dateitranskription gewählte Engine.
zh_hans: “添加到 Obsidian”会在此文件夹中创建以视频命名的笔记，第一行为链接，并在转录完成后添加转录文本。使用“文件转录”中选择的引擎。

source: None
de: Keiner
zh_hans: 无

source: Choose…
de: Auswählen …
zh_hans: 选择…

source: Subfolder
de: Unterordner
zh_hans: 子文件夹

source: Vault root
de: Vault-Hauptordner
zh_hans: 库根目录

source: Transcribing…
de: Wird transkribiert …
zh_hans: 正在转录…

source: Transcript added
de: Transkript eingefügt
zh_hans: 已添加转录文本

source: Open
de: Öffnen
zh_hans: 打开

source: Choose Vault
de: Vault auswählen
zh_hans: 选择库

source: Choose an Obsidian vault first.
de: Wähle zuerst einen Obsidian-Vault aus.
zh_hans: 请先选择一个 Obsidian 库。

source: The Obsidian vault folder was not found: %@
de: Der Obsidian-Vault-Ordner wurde nicht gefunden: %@
zh_hans: 未找到 Obsidian 库文件夹：%@

source: The Obsidian note no longer exists: %@
de: Die Obsidian-Notiz existiert nicht mehr: %@
zh_hans: 该 Obsidian 笔记已不存在：%@

source: Transcription failed
de: Transkription fehlgeschlagen
zh_hans: 转录失败

source: Cancel
de: Abbrechen
zh_hans: 取消

source: Check again
de: Erneut prüfen
zh_hans: 重新检查

source: Download audio from a supported web link and pass it to TypeWhisper's regular file-transcription queue.
de: Lädt Audio aus einem unterstützten Weblink und übergibt es an die normale Dateitranskriptions-Warteschlange von TypeWhisper.
zh_hans: 从受支持的网页链接下载音频，并将其添加到 TypeWhisper 的常规文件转录队列。

source: Download complete
de: Download abgeschlossen
zh_hans: 下载完成

source: Downloading media…
de: Medium wird heruntergeladen…
zh_hans: 正在下载媒体…

source: Helper tools
de: Hilfsprogramme
zh_hans: 辅助工具

source: Homebrew found at %@.
de: Homebrew wurde unter %@ gefunden.
zh_hans: 在 %@ 找到 Homebrew。

source: Homebrew was not found. Install the helper tools manually or install Homebrew first.
de: Homebrew wurde nicht gefunden. Installiere die Hilfsprogramme manuell oder zuerst Homebrew.
zh_hans: 未找到 Homebrew。请手动安装辅助工具，或先安装 Homebrew。

source: Homebrew was not found. Install yt-dlp and ffmpeg manually, then check again.
de: Homebrew wurde nicht gefunden. Installiere yt-dlp und ffmpeg manuell und prüfe danach erneut.
zh_hans: 未找到 Homebrew。请手动安装 yt-dlp 和 ffmpeg，然后重新检查。

source: Homebrew will download and install: %@
de: Homebrew lädt Folgendes herunter und installiert es: %@
zh_hans: Homebrew 将下载并安装：%@

source: Homebrew could not install the helper tools.
de: Homebrew konnte die Hilfsprogramme nicht installieren.
zh_hans: Homebrew 无法安装辅助工具。

source: Install helper tools?
de: Hilfsprogramme installieren?
zh_hans: 安装辅助工具？

source: Install missing tools with Homebrew
de: Fehlende Programme mit Homebrew installieren
zh_hans: 使用 Homebrew 安装缺少的工具

source: Install with Homebrew
de: Mit Homebrew installieren
zh_hans: 使用 Homebrew 安装

source: Missing helper tools: %@. Open the add-on settings to install them.
de: Fehlende Hilfsprogramme: %@. Öffne die Add-on-Einstellungen, um sie zu installieren.
zh_hans: 缺少辅助工具：%@。请打开此附加组件的设置进行安装。

source: No helper tool is downloaded without confirmation. Homebrew verifies and manages the installed packages.
de: Kein Hilfsprogramm wird ohne Bestätigung heruntergeladen. Homebrew prüft und verwaltet die installierten Pakete.
zh_hans: 未经确认不会下载任何辅助工具。Homebrew 会验证并管理已安装的软件包。

source: Not installed
de: Nicht installiert
zh_hans: 未安装

source: Open Homebrew setup
de: Homebrew-Einrichtung öffnen
zh_hans: 打开 Homebrew 设置

source: Ready
de: Bereit
zh_hans: 就绪

source: The download did not produce a supported audio or video file.
de: Der Download hat keine unterstützte Audio- oder Videodatei erzeugt.
zh_hans: 下载未生成受支持的音频或视频文件。

source: The link must be a valid HTTP or HTTPS URL.
de: Der Link muss eine gültige HTTP- oder HTTPS-URL sein.
zh_hans: 链接必须是有效的 HTTP 或 HTTPS URL。

source: The media download failed.
de: Der Medien-Download ist fehlgeschlagen.
zh_hans: 媒体下载失败。

source: The Web Link add-on is not active.
de: Das Weblink-Add-on ist nicht aktiv.
zh_hans: Web Link 附加组件未启用。

source: Transcribe Web Link…
de: Weblink transkribieren…
zh_hans: 转录网页链接…

source: Web Link Transcription
de: Weblink-Transkription
zh_hans: 网页链接转录

source: Web Link Transcription Settings…
de: Weblink-Transkriptionseinstellungen…
zh_hans: 网页链接转录设置…

source: Add Link
de: Link hinzufügen
zh_hans: 添加链接

source: Open add-on settings…
de: Add-on-Einstellungen öffnen…
zh_hans: 打开附加组件设置…

source: Paste a supported video or audio link. The add-on downloads its audio and adds it to TypeWhisper's transcription queue.
de: Füge einen unterstützten Video- oder Audio-Link ein. Das Add-on lädt die Audiospur herunter und fügt sie der Transkriptionswarteschlange von TypeWhisper hinzu.
zh_hans: 粘贴受支持的视频或音频链接。附加组件会下载其音轨并添加到 TypeWhisper 的转录队列。

source: Paste a video or audio link
de: Video- oder Audio-Link einfügen
zh_hans: 粘贴视频或音频链接

source: Preparing web link download
de: Weblink-Download wird vorbereitet
zh_hans: 正在准备网页链接下载

source: The downloaded media was added to the transcription queue.
de: Das heruntergeladene Medium wurde der Transkriptionswarteschlange hinzugefügt.
zh_hans: 下载的媒体已添加到转录队列。

source: The Web Link add-on is not ready.
de: Das Weblink-Add-on ist noch nicht bereit.
zh_hans: Web Link 附加组件尚未就绪。

source: Transcribe audio from a web link
de: Audio aus einem Weblink transkribieren
zh_hans: 转录网页链接中的音频

source: TypeWhisper could not add the downloaded media to the transcription queue.
de: TypeWhisper konnte das heruntergeladene Medium nicht zur Transkriptionswarteschlange hinzufügen.
zh_hans: TypeWhisper 无法将下载的媒体添加到转录队列。

source: Vault
zh_hans: 库

source: Web Link
zh_hans: 网页链接
